{
  "topics": [
    {
      "topic": "Complete Markets and Equivalent Martingale Measures",
      "sub_topics": [
        "Theorems on Complete and Arbitrage-Free Markets: Theorem 2.1 states that in a complete and arbitrage-free market, there is a unique price process VH = (VHk)k=0,1,...,T for every payoff H \\u2208 L(FT) that admits no arbitrage; this price process is given by VHk = EQ[H|Fk] for any EMM Q for S. Theorems 2.1 and 2.2 offer a description of discounted financial market models in finite discrete time: existence of an EMM is equivalent to the market being arbitrage-free, and uniqueness of the EMM is equivalent to completeness of the market.",
        "Limitations of Complete Markets: The multinomial model with a bank account and one stock is incomplete whenever m > 2, i.e., when there is a node in the tree allowing for more than two possible stock price evolutions, which results in infinitely many EMMs. If a model with d = 1 (one risky asset) and i.i.d. returns Y1, ..., YT under P has a density (e.g., lognormal returns), then S is incomplete because FT must be infinite for Y1 to have a density; alternatively, different EMMs can be constructed.",
        "Implications of Completeness: A financial market is considered complete if every payoff H in L0(FT) is attainable, meaning that any contingent claim can be perfectly replicated by trading existing assets, which simplifies valuation and hedging. A discounted financial market model in finite discrete time is complete if and only if there is a unique equivalent martingale measure for S, meaning that the absence of arbitrage and completeness are directly linked to the uniqueness of the risk-neutral measure. The concept of completeness ensures that any derivative can be perfectly hedged, eliminating model risk, but it also implies that the market structure is restrictive, often leading to finite tree models for practical applications."
      ]
    },
    {
      "topic": "Binomial Model: A Practical Example",
      "sub_topics": [
        "Model Description and Properties: The binomial model is defined by parameters p \\u2208 (0,1) and u > r > d > -1, where S = (1 + r)k and S = S0 \\u220fj=1 Yj, with S0 > 0 and Y1, ..., YT i.i.d. under P taking values 1 + u or 1 + d with probability p or 1 \\u2013 p, respectively. The filtration IF is generated by S = (S0, S1) or equivalently by S1 or by Y. The binomial model simplifies computations by using a recombining tree structure, reducing the number of nodes and computation time, especially for path-independent options.",
        "Arbitrage-Free and Complete Market: This model is arbitrage-free and has a unique EMM for S1 = S1/S0. Hence S1 is complete by Theorem 2.2, and so every H\\u2208 L(FT) is attainable, with a price process given by VkH = EQ*[H | Fk] for k = 0,1,..., T, where Q* is the unique EMM for S1.",
        "Risk-Neutral Valuation and EMM: In the binomial model, the risk-neutral valuation can be computed using the unique EMM Q* for S1. The Yj are under Q* again i.i.d., but with Q*[Y1 = 1 + u] = q* := (r-d)/(u-d) \\u2208 (0,1). In the binomial model, the price process of any undiscounted payoff can be determined using conditional expectations under the unique EMM, leading to a recursive algorithm for computing option prices.",
        "Binomial Call Pricing Formula: By combining the above results, the binomial call pricing formula can be derived, which is the discrete analogue of the famous Black-Scholes formula. This formula provides a recursive algorithm for computing the price of an option at each node of the binomial tree. The binomial call pricing formula is a discrete-time analogue of the Black-Scholes formula, where the option price is calculated based on the probability of the asset price exceeding the strike price at maturity, adjusted for the risk-neutral probabilities.",
        "Replicating Strategy and Hedging: To work out the replicating strategy in the binomial model, we recall that VHk = Vk(V0, v) = V0 + \\u03a3j=1k vj\\u0394Sj for k = 0, 1, ..., T; the hedging strategy \\u03b8k can be computed using the values of VH and Sk at each node in the tree. The replicating strategy in the binomial model can be computed recursively by determining the number of shares to hold at each node of the tree, ensuring that the portfolio replicates the option payoff at maturity."
      ]
    },
    {
      "topic": "Arbitrage-Free Valuation of Attainable Payoffs: Theorems and Conditions",
      "sub_topics": [
        "Valuation Theorem: In a discounted financial market in finite discrete time, if S is arbitrage-free and F0 is trivial, every attainable payoff H has a unique price process VH = (VHk)k=0,1,...,T that admits no arbitrage; this price process is given by VHk = EQ[H|Fk] for any equivalent martingale measure Q for S. Theorem 1.1 provides an efficient way to compute the price process of an attainable payoff by taking conditional expectations under an Equivalent Martingale Measure (EMM) Q; however, it's crucial to determine whether a payoff is attainable before applying this theorem.",
        "Characterization of Attainable Payoffs: Theorem 1.2 characterizes attainable payoffs by stating that H is attainable if and only if the supremum of EQ[H] over all equivalent martingale measures Q is finite and attained in some Q* \\u2208 IPe,loc(S), or if EQ[H] is constant for all EMMs Q for S.",
        "Approach to Valuing and Hedging: The approach to valuing and hedging a given payoff H in a financial market in finite discrete time involves checking if S is arbitrage-free, finding all EMMs Q for S, and computing EQ[H] for all EMMs; if the supremum is finite and attained, H is attainable and its price process can be computed.",
        "Risk-Neutral Valuation and EMM Choice: Risk-neutral valuation, derived from Theorem 1.1, involves computing conditional expectations of a payoff H under an EMM Q, often called a risk-neutral measure; however, the choice of Q is critical, especially if H is not attainable, as VHk depends on Q in such cases.",
        "Incomplete Markets and Valuation Challenges: If H is not attainable, it is unclear how to hedge H safely, and the valuation may involve subjective preferences of the option seller; in such cases, any valuation should be treated with caution due to substantial arbitrariness and lack of clear risk management.",
        "Completeness and Valuation: A financial market model is complete if every payoff H \\u2208 L(FT) is attainable; otherwise, it is incomplete; in a complete market, absence of arbitrage is sufficient to value any attainable payoff."
      ]
    }
  ]
}