{
  "topics": [
    {
      "topic": "Basics about Brownian Motion",
      "sub_topics": [
        "Brownian motion (BM) is the continuous-time analogue of the Cox-Ross-Rubinstein binomial model and converges to the Black-Scholes model. It serves as the stochastic process driving the Black-Scholes model and is conceptually a dynamic version of the normal distribution, playing a central role in modeling stochastic phenomena and holding fundamental importance in various areas, including quantitative finance. The notation W is used in honor of Norbert Wiener, who provided the first rigorous proof of its existence, although Louis Bachelier and Albert Einstein had previously introduced and utilized it in finance and physics, respectively.",
        "A Brownian motion W with respect to a probability measure P and a filtration IF = (Ft)t≥0 is a real-valued stochastic process W = (Wt)t≥0 adapted to IF, starting at 0 (Wo = 0 P-a.s.), and satisfying specific properties. Two equivalent definitions exist: (1) For s < t, the increment Wt – Ws is independent (under P) of Fs with (under P) a normal distribution N(0, t – s), and W has continuous trajectories, meaning that for P-almost all ω ∈ Ω, the function t → Wt(ω) on [0, ∞) is continuous. (2) Without filtration IF, W starts at 0, has continuous trajectories, and for any n ∈ ℕ and times 0 = t0 < t1 < ... < tn < ∞, the increments Wti - Wti-1 are independent with Wti - Wti-1 ~ N(0, ti - ti-1), or N(0, (ti - ti-1)Im×m) if W is ℝm-valued, reflecting independent stationary increments with a specific normal distribution. The two definitions are equivalent if IF is the filtration IFW generated by W (and made right-continuous and P-complete).",
        "Brownian motion in ℝm is an adapted ℝm-valued stochastic process null at 0 such that the condition for increments holds with N(0, t – s) replaced by N(0, (t – s)Im×m), where Im×m denotes the m × m identity matrix, which is equivalent to saying that the m components are all real-valued Brownian motions and independent (as processes).",
        "Several transformations produce a new Brownian motion from a given one: W1 := −W is a BM; W2 := Wt+T − WT, t ≥ 0, is a BM for any T ∈ (0, ∞) (restarting at a fixed time T); W3 := cWt, t ≥ 0, is a BM for any c ∈ ℝ, c ≠ 0 (rescaling in space and time); W4 := WT−t − WT, 0 ≤ t ≤ T, is a BM on [0, T] for any T ∈ (0, ∞) (time-reversal); the process Wt*, t ≥ 0, defined by tW1/t for t > 0 and 0 for t = 0, is a BM (inversion of small and large times). These transformations can be used to prove results about BM.",
        "The asymptotic behavior of BM as t tends to infinity is related to the behavior of BM near time 0, and vice versa. The Law of the Iterated Logarithm (LIL) provides insights into the asymptotic behavior of Brownian motion, with both global and local versions. The global LIL describes how Wt oscillates between ±√(2t log(log t)) as t approaches infinity, while the local LIL describes the oscillations of Wt+h - Wt around the level of Wt as h approaches 0. Specifically, with glob(t) := √(2t log(log t)), the limit superior and inferior of Wt/glob(t) as t approaches infinity are +1 and -1 P-a.s., respectively, and similarly for the local version with loc(h) := √(2h log(log h)). The local law of the iterated logarithm describes the oscillations of the trajectory u → W1(w) around the level W1(w), indicating that BM crosses the level 0 (or any level a) infinitely often and manages to perform infinite crossings in an arbitrarily short period of time.",
        "Brownian motion trajectories are continuous but nowhere differentiable, exhibiting irregular behavior related to the fact that BM trajectories are continuous functions with a nonzero quadratic variation. The infinitesimal increments dWt have the property (dWt)² = dt, which is a purely formal but helpful concept for understanding stochastic calculus and Itô's formula. The quadratic variation of Brownian motion W is defined as (W)t = t, meaning that along a refining sequence of partitions (In)n∈N of [0, ∞) with mesh size approaching 0, the sum of squared increments of W converges to t with probability 1. Heuristically, the quadratic variation can be understood by the relation (dWt)² = dt, where dWt represents infinitesimal increments of the BM. A more precise description involves defining the p-variation of a function g on [0, T] along a partition Π. Continuous functions with nonzero quadratic variation must have infinite variation, and the variation of W(w) is +∞ for almost all trajectories W(w).",
        "The limit, called [M]t, of the sequence (QI(M))n∈ℕ is not t, but some random variable (Ft-measurable), and the convergence does not hold almost certainly in probability for general local martingales M instead of Brownian motion W."
      ]
    },
    {
      "topic": "Martingale Properties and Results",
      "sub_topics": [
        "A martingale M = (Mt) with respect to P and IF is a real-valued stochastic process adapted to IF, P-integrable (each Mt is in L1(P)), and satisfies the martingale property: E[Mt | Fs] = Ms P-a.s. for s < t. If the inequality is '<', it's a supermartingale; if '>', it's a submartingale. A general result from the theory of stochastic processes states that any martingale has a version with nice trajectories (RCLL, i.e., right-continuous with left limits).",
        "A stopping time τ with respect to IF is a mapping τ : Ω → [0, ∞] such that {τ ≤ t} ∈ Ft for all t ≥ 0, and one of the standard examples is the first time that some adapted right-continuous process X (e.g., Brownian motion W) hits an open set B (e.g., (a, ∞)), i.e., τ := inf{t > 0 : Xt ∈ B}.",
        "One of the most useful properties of martingales is that the martingale property E[Mt | Fs] = Ms and its consequences often extend to the case where the fixed times s < t are replaced by stopping times σ < τ; to make sense of this, it is necessary to define the σ-algebra of events observable up to time σ as Fσ := {A ∈ F : A ∩ {σ ≤ t} ∈ Ft for all t ≥ 0}.",
        "The value of M at the stopping time τ is defined as Mτ(ω) := Mτ(ω)(ω), and if τ is a stopping time and M is an adapted process with RC trajectories, then Mτ is Fτ-measurable; the stopped process Mτ = (Mt∧τ)t≥0 is defined by Mtτ := Mt∧τ for all t > 0, and if M is adapted with RC trajectories and τ is a stopping time, then Mτ will also be adapted and have RC trajectories.",
        "The Stopping Theorem asserts that for a (P, IF)-martingale M = (Mt)t≥0 with RC trajectories and IF-stopping times σ ≤ τ, if τ is bounded by some T ∈ (0, ∞) or M is uniformly integrable, then Mσ, Mτ are in L1(P) and E[Mτ | Fσ] = Mσ P-a.s.",
        "For any RC martingale M and any stopping time τ, we have E[Mτ∧t|Fs] = Mτ∧s for s ≤ t, i.e., the stopped process Mτ = (Mt∧τ)t≥0 is again a martingale (because we have E[Mtτ |Fs] = Msτ); if M is an RC martingale and τ is any stopping time, then we always have for any t > 0 that E[Mτ∧t] = E[M0], and if τ is bounded or M is uniformly integrable, then we also obtain E[Mτ] = E[M0]. The conditions of the Stopping Theorem are necessary: consider a Brownian motion W and the stopping time τ := inf{t > 0 : Wt > 1}; due to the law of the iterated logarithm, we have τ < ∞ P-a.s., and since W has continuous trajectories, we obtain Wτ = 1 P-a.s.; for σ = 0, if the theorem were valid for W and τ, σ, we should obtain, taking expectations, that 1 = E[Wτ] = E[Wσ] = E[W0] = 0, which is clearly false.",
        "An adapted process X = (Xt)t≥0 null at 0 (i.e., with X0 = 0) is called a local martingale null at 0 (with respect to P and IF) if there exists a sequence of stopping times (τn)n∈ℕ increasing to ∞ such that for each n ∈ ℕ, the stopped process Xτn = (Xt∧τn)t≥0 is a (P, IF)-martingale, and (τn)n∈ℕ is then called a localising sequence.",
        "Given a (P, IF)-Brownian motion W = (Wt)t≥0, the following processes are (P, IF)-martingales: W itself, W² - t for t ≥ 0, and eαWt - (α^2)t/2 for t ≥ 0 and any α ∈ ℝ. These processes satisfy the martingale property E[Mt | Fs] = Ms, which is shown using the properties of Brownian motion and its normal distribution.",
        "A useful application of the martingale results is the calculation of Laplace transforms of certain stopping times: let W = (Wt)t≥0 be a Brownian motion and define for a > 0, b > 0 the stopping times τa := inf{t ≥ 0 : Wt > a} and σa,b := inf{t ≥ 0 : Wt > a + bt}; then, for any λ > 0, we have E[e^(-λτa)] = e^(-a√(2λ)) and E[e^(-λσa,b)] = E[e^(-λσa,b)I{σa,b<∞}] = e^(-a(b+√(b²+2λ))). For a general random variable U > 0, the function λ → E[e^(-λU)] for λ > 0 is called the Laplace transform of U, and its general importance in probability theory is that it uniquely determines the distribution of U; both τa and σa,b arise in connection with various exotic options in mathematical finance, particularly for barrier options, whose payoff depends on whether a (upper or lower) level has been hit or not at some given time."
      ]
    },
    {
      "topic": "Markovian Properties",
      "sub_topics": [
        "For a Brownian motion (Wt)t≥0 and any fixed time T ∈ (0, ∞), the process Wt+T - WT, t ≥ 0, is again a Brownian motion, implying that restarting a Brownian motion from level 0 at some fixed time results in a process that behaves as if it had only just started; the increments Wt+T - WT, t ≥ 0, are independent of FT, where FT = σ(Ws, s ≤ T) is the σ-field generated by BM up to time T, meaning that BM at any fixed time T simply forgets its past up to time T (with the only possible exception that it remembers its current position WT at time T) and starts afresh.",
        "The Markov property of Brownian motion states that for functions g ≥ 0 applied to the part of BM after time T, E[g(Wu, u ≥ T) | σ(Ws, s ≤ T)] = E[g(Wu, u ≥ T) | σ(WT)], indicating that the behavior of W after time T depends only on the current value WT and not on the past. If we are interested in the behavior of W after time T and try to predict this based on the past of W up to time T, we may as well forget the past and look only at the current value WT at time T.",
        "The Markov property of BM can be interesting and useful if we replace the fixed time T ∈ (0, ∞) by a stopping time τ; however, it is not clear whether this would be true, as τ itself may depend explicitly on the past behavior of BM; however, BM is said to have the strong Markov property. A precise analogue of the Markov property for a stopping time becomes a bit technical: if we denote almost as above by IFW the filtration generated by W (and made right-continuous, to be precise), and if τ is a stopping time with respect to IFW and such that τ < ∞ P-a.s., then Wt+τ - Wτ, t≥0, is again a BM and independent of FτW, which includes the previous properties as special cases."
      ]
    }
  ]
}