{
  "topics": [
    {
      "topic": "Financial Markets in Finite Discrete Time",
      "sub_topics": [
        "Financial markets operate under uncertainty, particularly regarding the future evolution of asset prices, necessitating the use of probability theory to model trading. A probability space (\\u03a9, F, P) is fundamental, where \\u03a9 represents the sample space, F is the sigma-algebra of events, and P is the probability measure. Time in these markets evolves in discrete steps over a finite horizon, labeled as k = 0, 1, ..., T, with T \\u2208 IN, representing trading dates. The flow of information over time is described by a filtration IF = (Fk)k=0,1,...,T, where each Fk is a sigma-algebra representing events observable up to time k, and the filtration is increasing, meaning Fk \\u2286 Fl for k \\u2264 l.",
        "A stochastic process X = (Xk)k=0,1,...,T, where each Xk is a random variable defined on the probability space (\\u03a9, F, P), describes the evolution of asset prices or portfolio holdings over time. This process is adapted to the filtration IF if each Xk is Fk-measurable, meaning its value is known at time k, and it is predictable if each Xk is Fk-1-measurable, indicating its value can be predicted based on information available up to time k-1. The filtration IF represents the information available to investors over time, influencing their trading decisions; for example, stock prices are typically adapted because they are known at the current date, while trading strategies must be predictable to avoid insider trading, reflecting decisions made before knowing the next price movement.",
        "In a multiplicative model, asset prices evolve based on random variables rk (interest rate) and Yk (growth factor). The bank account S\\u00ba evolves with interest rate rk, while the stock price S\\u00b9 evolves with growth factor Yk, both adapted to the filtration IF, which is often generated by the random variables Yk. The binomial model simplifies asset price evolution by assuming constant interest rates (r) and two possible values for the growth factor (1 + u with probability p, and 1 + d with probability 1 - p), leading to the Cox-Ross-Rubinstein (CRR) binomial model, where stock prices move up or down by fixed factors at each step. The filtration IF' can be generated by both Y and r, encompassing more information than just Y; if the interest rate r is predictable, the filtrations IF and IF' are equivalent, simplifying the model."
      ]
    },
    {
      "topic": "Financial Markets and Trading",
      "sub_topics": [
        "A discrete-time financial market model uses stochastic processes to describe asset prices and trading strategies, with gains or losses from trade represented by discrete-time stochastic integrals, starting from a filtered probability space (\\u03a9, F, P) with filtration IF = (Fk)k=0,1,...,T. Asset prices are specified by a strictly positive adapted process S\\u00ba (reference asset or numeraire) and an IRd-valued adapted process S (risky assets); the reference asset S\\u00ba is assumed to be strictly positive and often predictable, while the risky assets S represent the prices of d different stocks.",
        "Prices and values are expressed relative to the reference asset S\\u00ba, a process known as discounting, where all traded quantities are divided by S\\u00ba; this simplifies the model by setting the discounted price of the reference asset to 1, effectively working with zero interest rates. A frictionless financial market assumes no transaction costs, equal borrowing and lending rates, unlimited asset availability, and negligible investor impact on prices; while unrealistic, this simplification helps explain basic concepts.",
        "A trading strategy is an IRd+1-valued stochastic process \\u03c6 = (\\u03c6\\u00ba, \\u03b8), where \\u03c6\\u00ba represents holdings in the reference asset and \\u03b8 represents holdings in the risky assets; the value process V(\\u03c6) tracks the portfolio's value over time, calculated as the sum of holdings in the reference asset and the value of holdings in the risky assets. The trading strategy must be predictable, meaning that \\u03b8k, the holdings in risky assets, must be Fk-1-measurable to avoid insider trading; the pre-trade value of the strategy at time k is represented by Vk(\\u03c6), and investors start without any shares, investing only in the reference asset at time 0."
      ]
    },
    {
      "topic": "Trading Strategies and Value Process",
      "sub_topics": [
        "A trading strategy is defined as an \\u211dd+1-valued stochastic process \\u03c6 = (\\u03c6^0, \\u03b8), where \\u03c6^0 = (\\u03c6_k^0)_{k=0,1,...,T} is real-valued and adapted, representing bank account holdings, and \\u03b8 = (\\u03b8k)k=0,1,...,T is \\u211dd-valued and predictable, representing holdings in risky assets, with \\u03b8\\u2080 = 0. The value process V(\\u03c6) = (Vk(\\u03c6))k=0,1,...,T represents the value of the portfolio at time k, given by Vk(\\u03c6) := \\u03c6_k^0 + \\u03b8_k \\u00b7 S_k, where \\u03c6_k^0 is the bank account value and \\u03b8_k \\u00b7 S_k is the value of risky asset holdings.",
        "The incremental cost \\u0394Ck+1(\\u03c6) represents the cost of changing the portfolio from \\u03c6k to \\u03c6k+1 at time k, given by \\u0394Ck+1(\\u03c6) := Ck+1(\\u03c6) \\u2013 Ck(\\u03c6) = (\\u03c6_{k+1}^0 - \\u03c6_k^0) + (\\u03b8_{k+1} - \\u03b8_k) \\u00b7 Sk, where C0(\\u03c6) = \\u03c6_0^0 = V0(\\u03c6) is the initial cost. The gains process G(\\u03c6) = (Gk(\\u03c6))k=0,1,...,T represents the cumulative gains from the trading strategy, with Gk(\\u03c6) := \\u03a3_{j=1}^k \\u03b8_j \\u00b7 \\u0394S_j, where \\u0394S_j is the change in asset prices at time j. The cost process Ck(\\u03c6) is defined as Ck(\\u03c6) := Vk(\\u03c6) \\u2013 Gk(\\u03c6).",
        "A self-financing strategy is one where the cost process C(\\u03c6) is constant over time, meaning changes in the portfolio are cost-neutral. This is satisfied if \\u03c6_{k+1}^0 - \\u03c6_k^0 + (\\u03b8_{k+1} - \\u03b8_k) \\u00b7 Sk = 0 for each k. An equivalent description is V(\\u03c6) = V0(\\u03c6) + G(\\u03c6)."
      ]
    },
    {
      "topic": "Self-Financing Strategies",
      "sub_topics": [
        "Definition of a self-financing strategy as one where the cost process C(\\u03c6) is constant over time, meaning changes in the portfolio are cost-neutral and funded entirely by gains or losses from asset price changes. Explanation of the equivalent condition for self-financing strategies: V(\\u03c6) = V0(\\u03c6) + G(\\u03c6), indicating the value of the portfolio equals the initial investment plus cumulative gains.",
        "Proposition that any self-financing trading strategy is uniquely determined by its initial wealth V0 and risky asset component \\u03b8, allowing a simplified representation as \\u03c6 = (V0, \\u03b8). Discussion of the economic budget constraint represented by the self-financing condition, formulated through financial bookkeeping requirements, and its numeraire-invariant property.",
        "Example of a stopping strategy, where trading actions are determined by a random time \\u03c4, and the requirement that \\u03c4 be a stopping time to ensure predictability of the strategy. Definition of an \\u03b1-admissible trading strategy, where the value process V(\\u03c6) is uniformly bounded from below by -\\u03b1, representing a credit line or limit on debts, and its importance for preventing pathological effects in continuous time models."
      ]
    },
    {
      "topic": "Important Martingale Results",
      "sub_topics": [
        "A stochastic process X = (Xk)k=0,1,...,T is a martingale with respect to Q and IF if it is adapted to IF, Q-integrable (Xk \\u2208 L\\u00b9(Q) for each k), and satisfies EQ[Xl|Fk] = Xk Q-a.s. for k \\u2264 l, meaning the best prediction for the later value Xl given earlier information Fk is the current value Xk. Explanation that the martingale property depends on the probability measure used, and a process can be a martingale under one measure but not another.",
        "Example of the discounted stock price S1/S0 in the binomial model being a P-martingale if and only if r = pu + (1 \\u2212 p)d, relating interest rates to probabilities and asset price movements. Definition of a local martingale as an adapted process X that is null at 0 and has a sequence of stopping times (\\u03c4n)n\\u2208N increasing to T such that the stopped process XTn is a martingale.",
        "Theorem stating that for a martingale or local martingale X and a predictable process \\u03b8, the stochastic integral process \\u03b8\\u2022X is a local martingale, and if X is a martingale and \\u03b8 is bounded, then \\u03b8\\u2022X is a martingale. Corollary stating that for any martingale X and stopping time \\u03c4, the stopped process X\\u03c4 is again a martingale, preserving the martingale property under stopping. Theorem stating that if the stochastic integral process \\u03b8\\u2022X is uniformly bounded below, then \\u03b8\\u2022X is a Q-martingale."
      ]
    },
    {
      "topic": "The Multinomial Model",
      "sub_topics": [
        "The multinomial model is a multiplicative model with i.i.d. returns, where the stock price at time k is given by S_k = S_0 * \\u03a0_{j=1}^k (1 + r_j), where r_j are i.i.d. random variables taking finitely many values 1 + y_1, ..., 1 + y_m with probabilities p_1, ..., p_m. The model assumes that the bank account changes by a factor of 1 + r at each step, while the stock changes by a random factor that can only take the m different values 1 + y_j, j = 1, ..., m.",
        "The filtration is generated by the stock price process S, so that F_k = \\u03c3(S_1, ..., S_k), meaning that up to time k, we can observe the values of S_1, ..., S_k. Explanation of the path space representation of the multinomial model, where the sample space \\u03a9 consists of all strings of length T formed by elements of {1, ..., m}, and the probability measure P is defined by multiplication of probabilities.",
        "Characterization of atoms of the \\u03c3-field Fk in the path-space setting, representing minimal elements of G where minimality is measured with the help of P. Description of how information about the past grows and refines over time, with atoms of Fk forming a partition of \\u03a9. Explanation of how to factorize a probability measure Q on (\\u03a9, F) into its one-step transition probabilities, and how the coordinate variables Y1, ..., YT are independent under Q if and only if the one-step transition probabilities are the same for each node at time k."
      ]
    }
  ]
}