{
  "topics": [
    {
      "topic": "Stochastic Integration",
      "sub_topics": [
        "Stochastic integrals are foundational for describing trading gains/losses from self-financing strategies, extending discrete-time theory to continuous time. In this context, G(v) = ∫v dS = ∑vᵢΔSᵢ = ∑vᵢ(Sᵢ - Sᵢ₋₁) represents these gains/losses, where v is the trading strategy and S is the asset price. Continuous-time stochastic integrals are constructed by approximating Riemann sums (∑ v(tᵢ)(S(tᵢ₊₁) - S(tᵢ))), but this approach faces challenges when the integrator, like Brownian motion, lacks finite variation, necessitating alternative techniques.",
        "Defining stochastic integrals pathwise (ω by ω) is possible if the integrator S and integrand v are suitably matched, even without finite variation. Itô's formula exemplifies this, where v = g(Sₜ₋)dt for some C¹-function g.",
        "In stochastic integrals, the evaluation point tᵢ within [tᵢ, tᵢ₊₁] is crucial. Choosing the left endpoint tᵢ yields the Itô integral, the right endpoint tᵢ₊₁ the forward integral, and the midpoint (tᵢ + tᵢ₊₁)/2 the Stratonovich integral. For financial applications, the Itô integral is preferred because the trading strategy must be decided before the price move, reflecting the causal structure of trading decisions.",
        "The goal is to construct a stochastic integral process H•M = ∫HdM, where M is a real-valued local martingale null at 0, and H is a real-valued predictable process with suitable integrability relative to M.",
        "For any local martingale M, there exists a unique adapted increasing RCLL process [M] (quadratic variation) such that M² - [M] is also a local martingale; [M] can be obtained as the limit of sums of squared increments of M, satisfying Δ[M] = (ΔM)².",
        "The optional covariation process [M, N] for two local martingales M, N is defined by polarization: [M, N] := ¼([M + N] – [M - N]), which is a bilinear adapted RCLL process of finite variation such that MN - [M, N] is a local martingale and Δ[M, N] = ΔMΔN.",
        "The key difference between [M] and the predictable compensator <M> is that [M] exists for any local martingale M null at 0, while the existence of <M> requires extra local integrability of M.",
        "For a square-integrable martingale M and a bounded elementary process H, the stochastic integral H•M is also a square-integrable martingale, with [H•M] = ∫ H² d[M] and E[(H•M)²] = E[∫ H² d[M]], demonstrating the isometry property.",
        "The predictable σ-field P on Ω is generated by adapted left-continuous processes, crucial for defining predictable processes H as P-measurable mappings from Ω to ℝ and extending stochastic integrals beyond elementary processes.",
        "The space L²(M) consists of predictable processes H = (Hₜ)ₜ>0 such that ||H||L²(M) := (E[M[H²]])½ = (E[∫₀^∞ Hₜ² d[M]ₜ])½ < ∞, where E[M[Y]] := E[∫₀^∞ Y(ω) d[M]ₜ(ω)]."
      ]
    },
    {
      "topic": "Properties of Stochastic Integrals",
      "sub_topics": [
        "If M is a local martingale and H ∈ Lloc²(M), then ∫HdM is a local martingale in Mloc². If H ∈ L²(M), then ∫HdM is a martingale in M².",
        "If M is a local martingale and H is predictable and locally bounded, then ∫HdM is a local martingale. If M is a martingale in M² and H is predictable and bounded, then ∫HdM is a martingale in M².",
        "If M is a local martingale and H, H' ∈ Lloc²(M) and a, b ∈ ℝ, then (aH + bH')•M = a(H•M) + b(H'•M) (Linearity).",
        "If M is a local martingale and H ∈ Lloc²(M), then a predictable process K is in Lloc²(H•M) if and only if the product KH is in Lloc²(M), and K•(H•M) = (KH)•M (Associativity).",
        "If M is a local martingale, H ∈ Lloc²(M) and τ is a stopping time, then (H•M)τ = H•(Mτ) (Behavior under stopping).",
        "If M, N are local martingales, H ∈ Lloc²(M) and K ∈ Lloc²(N), then [∫ HdM, N] = ∫ Hd[M, N] and [∫ HdM, ∫ KdN] = ∫ HK d[M, N] (Quadratic variation and covariation).",
        "Suppose M is a local martingale and H ∈ Lloc²(M); then Δ(∫HdM)ₜ = HₜΔMₜ for t > 0, where ΔYₜ := Yₜ - Yₜ₋ denotes the jump at time t of a process Y with RCLL trajectories."
      ]
    },
    {
      "topic": "Extension to Semimartingales",
      "sub_topics": [
        "Semimartingales, denoted as X = (Xₜ)ₜ>0, are stochastic processes decomposable into X = X₀ + M + A, where M is a local martingale null at 0 and A is an adapted RCLL process null at 0 with trajectories of finite variation. If A is predictable, X is a special semimartingale with a unique canonical decomposition; this uniqueness relies on the fact that any local martingale that is predictable and of finite variation must be constant.",
        "The optional quadratic variation [X] of a semimartingale is defined as [X] = [M] + 2[M, A] + [A], where [M, A] represents the covariation between M and A.",
        "For semimartingales, stochastic integrals H•X are defined as H•X = H•M + H•A, where H•M is as defined for martingales and H•A is a Lebesgue-Stieltjes integral, requiring H to be predictable and locally bounded.",
        "If X is special with canonical decomposition X = X₀ + M + A, then H•X is also special, with canonical decomposition H•X = H•M + H•A.",
        "A key property of semimartingales is that if X is a semimartingale and f is a C²-function, then f(X) is also a semimartingale, a result derived from Itô's formula.",
        "If Hₙ, n ∈ ℕ, are predictable processes with Hₙ → 0 pointwise on Ω and |Hₙ| ≤ |H| for some locally bounded H, then Hₙ•X → 0 uniformly on compacts in probability.",
        "If X is a semimartingale with respect to P and R is a probability measure equivalent to P, then X is still a semimartingale with respect to R (follows from Girsanov's theorem).",
        "Semimartingales are natural processes for modeling discounted asset prices in financial markets, aligning with the fundamental theorem of asset pricing which posits that arbitrage-free models should have asset prices as local martingales under some equivalent measure Q. The Bichteler-Dellacherie theorem shows that one cannot extend beyond semimartingales without a serious loss, indicating their fundamental role as integrators."
      ]
    },
    {
      "topic": "Basic Construction",
      "sub_topics": [
        "The set bℌ consists of bounded elementary processes of the form H = ∑ hᵢI(tᵢ, tᵢ₊₁], where hᵢ are bounded F(tᵢ)-measurable random variables, and the stochastic integral ∫ HdX of H ∈ bℌ is defined as ∑ hᵢ(X(tᵢ₊₁) - X(tᵢ)).",
        "For Y ≥ 0 predictable, the measure PM := P ⊗ [M] is defined on (Ω, P) by ∫ Y dPM := E[M[Y] := E[∫ Y(ω) d[M](ω)], where the inner integral is a Lebesgue-Stieltjes integral.",
        "The space L²(M) consists of predictable processes H = (H(t)) such that ||H||²L²(M) := (E[M[H²]])½ = (E[∫ H(t)² d[M](t)])½ < ∞, where the integral is from 0 to infinity.",
        "For a fixed square-integrable martingale M, the mapping H → H•M is linear and maps from bℌ to the space M² of RCLL martingales N = (N(t)) null at 0 satisfying sup(t≥0) E[N(t)²] < ∞.",
        "The mapping H → H•M from bℌ to M² is linear and an isometry, and by general principles, this mapping can be uniquely extended to the closure of bℌ in L²(M), defining a stochastic integral process H•M for every H that can be approximated by processes from bℌ."
      ]
    },
    {
      "topic": "Itô's Formula",
      "sub_topics": [
        "Itô's formula extends the classical chain rule to stochastic processes. If X is a semimartingale and f is some (suitable) function, Itô's formula describes the stochastic process f(X) and provides a way to analyze its properties. In the simplest case, for a function x : [0, ∞) → ℝ and f : ℝ → ℝ, the classical chain rule from calculus states that d(f(x(t))) = f'(x(t)) dx(t).",
        "Itô's formula is crucial for continuous-time option pricing and the Black-Scholes formula.",
        "In formal differential notation, Itô's formula extends the classical chain rule to stochastic processes, expressing d(f ◦ x)(t) = f'(x(t)) dx(t), incorporating stochastic terms."
      ]
    },
    {
      "topic": "Stochastic Calculus",
      "sub_topics": [
        "Stochastic calculus provides tools for working with stochastic processes, particularly stochastic integrals, essential for continuous-time option pricing models like the Black-Scholes formula.",
        "Itô's formula addresses how to analyze stochastic processes f(X) where X is a semimartingale, determining the process's properties and structure. For a semimartingale X and a function f, Ito's formula provides an explicit expression for the stochastic process f(X).",
        "The stochastic integral ∫WdW for Brownian motion W is computed to illustrate the complexities of stochastic calculus, yielding  ∫WdW = (1/2)W² - (1/2)t, incorporating a second-order correction term from quadratic variation.",
        "Discontinuities in processes lead to jumps, quantified by Δ(∫HdM) = HΔMₜ for t > 0, where ΔYₜ represents the jump size of process Y at time t.",
        "Properties of stochastic integrals include linearity, associativity, and specific behaviors under stopping, essential for manipulating and computing stochastic integrals.",
        "Quadratic variation and covariation of stochastic integrals are defined, such as [∫HdM, ∫KdN] = ∫HKd[M, N], enabling the analysis of relationships between different stochastic integrals."
      ]
    }
  ]
}